[
  {
    "name": "P1",
    "type": "radio",
    "labels": [
      {
        "name": "Solid",
        "value": "s"
      },
      {
        "name": "Fine-solid",
        "value": "fs"
      },
      {
        "name": "Fluid",
        "value": "f"
      }
    ],
    "placeholder": "Material of phase 1",
    "description": "This parameter is only considered for the one-phase and the multi-phase model.\nx = mixture (for the Voellmy-type model only)\ns = solid\nfs = fine-solid\nf = fluid"
  },
  {
    "name": "P2",
    "type": "radio",
    "labels": [
      {
        "name": "Solid",
        "value": "s"
      },
      {
        "name": "Fine-solid",
        "value": "fs"
      },
      {
        "name": "Fluid",
        "value": "f"
      }
    ],
    "placeholder": "Material of phase 2",
    "description": "This parameter is only considered for the multi-phase model.\ns = solid\nfs = fine-solid\nf = fluid"
  },
  {
    "name": "P3",
    "type": "radio",
    "labels": [
      {
        "name": "Solid",
        "value": "s"
      },
      {
        "name": "Fine-solid",
        "value": "fs"
      },
      {
        "name": "Fluid",
        "value": "f"
      }
    ],
    "placeholder": "Material of phase 3",
    "description": "This parameter is only considered for the multi-phase model.\nx = mixture (for the Voellmy-type model only)\ns = solid\nfs = fine-solid\nf = fluid"
  },
  {
    "name": "cellize",
    "type": "number",
    "placeholder": "Cell size for simulation",
    "description": "Cell size in metres to be used for the model (only used for r.avaflow3G). If the cell size is not given, or if r.avaflow3W is used, the cell size is taken from the input elevation raster map (option elevation)."
  },
  {
    "name": "elevation",
    "type": "file",
    "placeholder": "Name of elevation raster map",
    "description": "Name of the input elevation raster map. Note that, in the release area, the map has to represent the bottom of the flow mass. This parameter is mandatory, its unit is metres."
  },
  {
    "name": "hrelease1",
    "type": "file",
    "placeholder": "Name of total or P1 release height raster map",
    "description": "Name of the input raster map representing the distribution of the release height of the mixture (for the mixture and one-phase models, or when rhrelease1 is given with the multi-phase model) or of P1. The unit is metres."
  },
  {
    "name": "hrelease2",
    "type": "file",
    "placeholder": "Name of total or P2 release height raster map",
    "description": "Name of the input raster map representing the distribution of the release height of P2. The unit is metres. This parameter is ignored for the mixture or one-phase model."
  },
  {
    "name": "hrelease3",
    "type": "file",
    "placeholder": "Name of total or P3 release height raster map",
    "description": "Name of the input raster map representing the distribution of the release height of P3. The unit is metres. This parameter is ignored for the mixture or one-phase model."
  },
  {
    "name": "hentrmax1",
    "type": "file",
    "placeholder": "Name of maximum height of total or P1 entrainment raster map",
    "description": "Name of the input raster map representing the distribution of the total maximum height of entrainment (for the mixture and one-phase models, or when rhentrmax1 is given with the multi-phase model) or of P1. The unit is metres."
  },
  {
    "name": "hentrmax2",
    "type": "file",
    "placeholder": "Name of maximum height of total or P2 entrainment raster map",
    "description": "Name of the input raster map representing the distribution of the maximum height of entrainment of P2. The unit is metres. This parameter is ignored for the mixture or one-phase model."
  },
  {
    "name": "hentrmax3",
    "type": "file",
    "placeholder": "Name of maximum height of total or P3 entrainment raster map",
    "description": "Name of the input raster map representing the distribution of the maximum height of entrainment of P3. The unit is metres. This parameter is ignored for the mixture or one-phase model."
  },
  {
    "name": "density",
    "type": "group",
    "typeOfGroup": "input",
    "description": "Densities of the phases, kg/m3",
    "fields": [
      {
        "name": "Density of P1",
        "shortName": "densityOfP1",
        "type": "number",
        "description": "For solid material, the grain density has to be used instead of the bulk density"
      },
      {
        "name": "Density of P2",
        "shortName": "densityOfP2",
        "type": "number",
        "description": "If applicable, the grain density has to be used instead of the bulk density. The density must not be higher than for P1"
      },
      {
        "name": "Density of P3",
        "shortName": "densityOfP3",
        "type": "number",
        "description": "The density must not be higher than the density given for P2"
      }
    ]
  },
  {
    "name": "friction",
    "type": "group",
    "typeOfGroup": "input",
    "description": "Friction parameters associated to each phase, degrees",
    "fields": [
      {
        "name": "Internal friction angle of P1",
        "shortName": "internalFrictionAngleOfP1",
        "type": "number",
        "description": "This value is neglected for fluid material. If the dynamic adaptation of friction is activated, the value is used to fit the exponential relationship. If the internal friction is lower than the basal friction, it is set equal to the basal friction. Note that, for fine solid material, friction angles >0 degrees may result in numerical issues."
      },
      {
        "name": "Basal friction angle of P1",
        "shortName": "basalFrictionAngleOfP1",
        "type": "number",
        "description": "This value is neglected for fluid material. If the dynamic adaptation of friction is activated, the value is used to fit the exponential relationship. Note that, for fine solid material, friction angles >0 degrees may result in numerical issues."
      },
      {
        "name": "Internal friction angle of P2",
        "shortName": "internalFrictionAngleOfP2",
        "type": "number",
        "description": "This value has to be set zo zero for purely viscous material. If the dynamic adaptation of friction is activated, it is used to fit the exponential relationship. If the internal friction is lower than the basal friction, it is set equal to the basal friction. Note that, for fine solid material, friction angles >0 degrees may result in numerical issues."
      },
      {
        "name": "Basal friction angle of P2",
        "shortName": "basalFrictionAngleOfP2",
        "type": "number",
        "description": "This value has to be set zo zero for purely viscous material. If the dynamic adaptation of friction is activated, it is used to fit the exponential relationship. Note that, for fine solid material, friction angles >0 degrees may result in numerical issues."
      },
      {
        "name": "Internal friction angle of P3",
        "shortName": "internalFrictionAngleOfP3",
        "type": "number",
        "description": "This value is neglected for fluid material."
      },
      {
        "name": "Basal friction angle of P3",
        "shortName": "basalFrictionAngleOfP3",
        "type": "number",
        "description": "This value is neglected for fluid material."
      },
      {
        "name": "Fluid friction number",
        "shortName": "fluidFrictionNumber",
        "type": "number",
        "description": "The fluid friction number is related, but not identical to Manning's n, as the fluid friction number is used with the flow height instead of the hydraulic radius. It only applies to the fluid phase. If the dynamic adaptation of friction is activated, this value is used to fit the exponential relationship."
      }
    ]
  },
  {
    "name": "viscosity",
    "type": "group",
    "typeOfGroup": "input",
    "description": "Viscosities of the phases",
    "fields": [
      {
        "name": "Kinematic viscosity of P1, m2/s",
        "shortName": "kinematicViscosityOfP1",
        "type": "number",
        "description": "The logarithm with base 10 of the viscosity has to be entered. Very low values have to be used for purely frictional materials. This parameter is neglected for solid material."
      },
      {
        "name": "Yield strength of P1, Pa",
        "shortName": "yieldStrengthOfP1",
        "type": "number",
        "description": "The yield strength of the material has to be entered. This parameter is neglected for solid material. If -9999 is provided for fine solid, the yield strength is computed automatically."
      },
      {
        "name": "Kinematic viscosity of P2, m2/s",
        "shortName": "kinematicViscosityOfP2",
        "type": "number",
        "description": "The logarithm with base 10 of the viscosity has to be entered. Very low values have to be used for purely frictional materials."
      },
      {
        "name": "Yield strength of P2, Pa",
        "shortName": "yieldStrengthOfP2",
        "type": "number",
        "description": "The yield strength of the material has to be entered. If -9999 is provided, the yield strength is computed automatically."
      },
      {
        "name": "Kinematic viscosity of P3, m2/s",
        "shortName": "kinematicViscosityOfP3",
        "type": "number",
        "description": "The logarithm with base 10 of the viscosity has to be entered."
      },
      {
        "name": "Yield strength of P3, Pa",
        "shortName": "yieldStrengthOfP3",
        "type": "number",
        "description": "The yield strength of the material has to be entered."
      }
    ]
  },
  {
    "name": "impactarea",
    "type": "file",
    "placeholder": "Name of observed impact area raster map",
    "description": "Name of the input raster map defining the observed impact area of the flow. Areas with observed impact should be indicated by positive values, areas with no observed impact by 0, no data areas by negative values."
  },
  {
    "name": "Time interval for output",
    "shortName": "tint",
    "type": "number",
    "placeholder": "Time interval for output",
    "description": "Real-time interval in seconds at which output information is displayed and written to files, multiplied with the factor for time scaling."
  },
  {
    "name": "End time of simulation",
    "shortName": "tend",
    "type": "number",
    "placeholder": "End time of simulation",
    "description": "Real time in seconds after which the simulations ends, multiplied with the factor for time scaling."
  },
  {
    "name": "rhentrmax1",
    "type": "number",
    "placeholder": "Ratio of maximum height of P1 entrainment",
    "description": "Dimensionless number in the range 0-1 indicating the ratio of maximum height of P1 entrainment out of the maximum total height of entrainment given by the parameter hentrmax1. The remaining fraction is assigned to P3, whereas the entrainable height of P2 is set to zero. This parameter is ignored for the mixture or one-phase model, or when hentrmax1 is not given."
  }
]
